frontend/modules/panel/controllers/ItemController.php

    public function actionShow($id) {
        $item = Item::findOne($id);
---
SELECT * FROM `item` WHERE `id`='2'