frontend/modules/panel/models/Account.php

SELECT * FROM `account` WHERE (`host_id`=1) AND (`remmenber_me`=1)
---
    public function getAccList() {
        $id = Yii::$app->user->identity->id;
        return $this->find()->where(['host_id' => $id, 'remmenber_me' => 1])->all();

SELECT * FROM `account` WHERE `tb_user_id`='3651881988'
---
    public function getKeyByUserId($tb_user_id){
        return $this->findOne(['tb_user_id' => $tb_user_id])->access_token;