frontend/modules/panel/models/Item.php

SELECT * FROM `item` WHERE (`tb_user_id`='3663470001') AND (`outer_id`='666112')
---
    public function getItemByOutIdAndUid($outer_id, $tb_user_id){
        return $this->findOne(['tb_user_id'=>$tb_user_id,'outer_id'=>$outer_id]);

SELECT * FROM `item` WHERE `tb_user_id`='3663470001'
---
    public function getItemListByUid($tb_user_id) {
        return $this->find()->where(['tb_user_id' => $tb_user_id])->all();